In [1]:
from datascience import*
import numpy as np

import warnings
warnings.simplefilter(action='ignore', category=np.VisibleDeprecationWarning)

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

# #Lists

In [2]:
#Row can be represented by a list because all are not of the same type

In [3]:
[1,2,3,4]

[1, 2, 3, 4]

In [4]:
[1, [3,4], 'T']

[1, [3, 4], 'T']

In [5]:
[1, [3,4], Table().with_column('K', [10,90])]

[1,
 [3, 4],
 K
 10
 90]

In [6]:
Table().with_columns('Numbers', [1,2,3,4,5])

Numbers
1
2
3
4
5

In [7]:
Table().with_columns('Numbers', np.arange(5))

Numbers
0
1
2
3
4

In [8]:
#TRIVIAL
t = Table().with_columns('Numbers', [1,2,3,4,'ohboy'])
t.column('Numbers').item(2)
#Notice that you get a string. If even one of your list element is a string, all are strings

'3'

In [9]:
#This is how a row is added
drinks = Table(['Drink', 'Cafe', 'Price'])
drinks

Drink | Cafe | Price

In [10]:
#Press Enter twice and you will get a table with eight rows
drinks = drinks.with_rows([
    ['Milk Tea', 'Asha', 5.5],
    ['Espresso', 'Strada', 1.75],
    ['Latte', 'Strada', 3.25],
    ['Espresso', 'FSM', 2]
])
drinks

Drink    | Cafe   | Price
Milk Tea | Asha   | 5.5
Espresso | Strada | 1.75
Latte    | Strada | 3.25
Espresso | FSM    | 2

# CROSS-CLASSIFICATION

In [11]:
##Between two categorical variables
##Grouping by Multiple Columns
##same .group

In [12]:
#.group()
#First argument: List of columns to group by
#(Optional)
#collect= :How to combine values

# Cross-classification: grouping by two columns

In [13]:
survey = Table.read_table('welcome_survey_fa21.csv')
survey = survey.where('Handedness', are.containing('t-handed'))
survey = survey.where('Handedness', are.not_containing(' handed'))
survey

Year   | Extraversion | Number of textees | Hours of sleep | Handedness   | First pant leg     | Sleep position
Second | 8            | 5                 | 6              | Right-handed | Right leg in first | On your left side
Second | 7            | 8                 | 7.5            | Right-handed | Right leg in first | On your left side
Second | 6            | 7                 | 7.5            | Right-handed | Left leg in first  | On your right side
Third  | 2            | 1                 | 8              | Right-handed | Right leg in first | On your back
Second | 4            | 3                 | 8              | Right-handed | Left leg in first  | On your stomach
First  | 5            | 4                 | 8              | Right-handed | Right leg in first | On your left side
First  | 6            | 3                 | 7              | Right-handed | Left leg in first  | On your stomach
First  | 5            | 2                 | 7              | Right-handed | Right leg in first | On your back
Second | 5            | 6                 | 7              | Right-handed | Right leg in first | On your back
First  | 4            | 12                | 8              | Right-handed | Left leg in first  | On your right side
... (1300 rows omitted)

### Group with two columns

### Do right-handed people tend to sleep on their left side and left-handed people sleep on their right

In [14]:
#We are interested in two columns. Therefore, pass a list as the first argument

In [15]:
survey.group(['Handedness', 'Sleep position'])

Handedness   | Sleep position     | count
Left-handed  | On your back       | 36
Left-handed  | On your left side  | 34
Left-handed  | On your right side | 30
Left-handed  | On your stomach    | 13
Right-handed | On your back       | 322
Right-handed | On your left side  | 296
Right-handed | On your right side | 383
Right-handed | On your stomach    | 196

In [16]:
#Can't use pivot
survey.group(['Handedness', 'Sleep position', 'First pant leg']).sort('count', descending=True)

Handedness   | Sleep position     | First pant leg     | count
Right-handed | On your right side | Right leg in first | 228
Right-handed | On your back       | Right leg in first | 145
Right-handed | On your left side  | Right leg in first | 143
Right-handed | On your back       | Left leg in first  | 123
Right-handed | On your left side  | Left leg in first  | 118
Right-handed | On your right side | Left leg in first  | 104
Right-handed | On your stomach    | Right leg in first | 103
Right-handed | On your stomach    | Left leg in first  | 60
Right-handed | On your back       | I don't know       | 54
Right-handed | On your right side | I don't know       | 51
... (14 rows omitted)

### Pivot Tables

In [ ]:
#To drop a row, first use pivot so that it becomes a column, then .drop() then pivot again

In [ ]:
#Group & Pivot are not an end-goal but a means to an end

In [26]:
#Same goal different operation
#Results are presented in a different way

In [18]:
#Produces a grid of counts or aggregated values
#Two required arguments
    #1) Variable that forms column label of grid
    #2) Variable that forms row labels of grid

In [19]:
##Two optional arguments (include both or neither)
    #values='column_label_to_aggregate'
    #collect='function_to_aggregate_with'

In [20]:
#The first argument expands to create columns titles
#The second argument rolls over down to create rows
survey.pivot('Handedness', 'Sleep position')

Sleep position     | Left-handed | Right-handed
On your back       | 36          | 322
On your left side  | 34          | 296
On your right side | 30          | 383
On your stomach    | 13          | 196

In [21]:
survey.pivot('Sleep position', 'Handedness')

Handedness   | On your back | On your left side | On your right side | On your stomach
Left-handed  | 36           | 34                | 30                 | 13
Right-handed | 322          | 296               | 383                | 196

### Aggregating numerical variables

In [22]:
survey.group('Sleep position', collect=np.average)

Sleep position     | Year average | Extraversion average | Number of textees average | Hours of sleep average | Handedness average | First pant leg average
On your back       |              | 5.31844              | 5.96089                   | 7.03212                |                    |
On your left side  |              | 5.48485              | 6.71212                   | 7.00682                |                    |
On your right side |              | 5.52542              | 7.0339                    | 7.04479                |                    |
On your stomach    |              | 5.76555              | 6.84689                   | 7.13636                |                    |

In [23]:
t = survey.select('Handedness', 'Sleep position', 'Hours of sleep')
t.group(['Handedness', 'Sleep position'], collect=np.average)

Handedness   | Sleep position     | Hours of sleep average
Left-handed  | On your back       | 6.68056
Left-handed  | On your left side  | 7.13235
Left-handed  | On your right side | 7.23333
Left-handed  | On your stomach    | 7
Right-handed | On your back       | 7.07143
Right-handed | On your left side  | 6.9924
Right-handed | On your right side | 7.03003
Right-handed | On your stomach    | 7.14541

In [25]:
#survey.pivot('Argument1', 'Argument2', what do we want to look at, how we want to look at it)
survey.pivot('Sleep position', 'Handedness', values='Hours of sleep', collect=np.average)

Handedness   | On your back | On your left side | On your right side | On your stomach
Left-handed  | 6.68056      | 7.13235           | 7.23333            | 7
Right-handed | 7.07143      | 6.9924            | 7.03003            | 7.14541

# Challenge Questions

In [ ]:
##Q) For each city, what's the height of the tallest building for each material?
##Q) For each city, whats the age difference between the oldest steel building and 
##the oldest concrete building

In [45]:
sky = Table.read_table('skyscrapers_v2.csv')
sky

name                              | material        | city          | height | completed
One World Trade Center            | mixed/composite | New York City | 541.3  | 2014
Willis Tower                      | steel           | Chicago       | 442.14 | 1974
432 Park Avenue                   | concrete        | New York City | 425.5  | 2015
Trump International Hotel & Tower | concrete        | Chicago       | 423.22 | 2009
Empire State Building             | steel           | New York City | 381    | 1931
Bank of America Tower             | mixed/composite | New York City | 365.8  | 2009
Stratosphere Tower                | concrete        | Las Vegas     | 350.22 | 1996
Aon Center                        | steel           | Chicago       | 346.26 | 1973
John Hancock Center               | steel           | Chicago       | 343.69 | 1969
Chrysler Building                 | steel           | New York City | 318.9  | 1930
... (1771 rows omitted)

In [46]:
sky = (sky.with_column('age', 2020-sky.column('completed')).drop('completed'))
sky.show(3)

In [47]:
sky.group(['city', 'material'])
#This tells us how many concrete buildings in Atlanta
#However, the question asked for the tallest building
#Hence, summarizing by count was not the right way to summarize
#Need to use a different aggregation function

city      | material        | count
Atlanta   | concrete        | 27
Atlanta   | mixed/composite | 4
Atlanta   | steel           | 7
Austin    | concrete        | 16
Austin    | steel           | 1
Baltimore | concrete        | 8
Baltimore | steel           | 6
Boston    | concrete        | 4
Boston    | mixed/composite | 2
Boston    | steel           | 26
... (81 rows omitted)

In [48]:
sky.group(['city', 'material'], collect=max)

city      | material        | name max                                | height max | age max
Atlanta   | concrete        | Westin Peachtree Plaza                  | 264.25     | 44
Atlanta   | mixed/composite | Two Alliance Center                     | 311.8      | 33
Atlanta   | steel           | State of Georgia Building               | 169.47     | 123
Austin    | concrete        | Windsor on the Lake                     | 208.15     | 36
Austin    | steel           | University of Texas Tower               | 93.6       | 83
Baltimore | concrete        | The John and Frances Angelos Law Center | 161.24     | 53
Baltimore | steel           | Mercy Medical Center Inpatient Tower    | 155.15     | 109
Boston    | concrete        | Harbor Towers II                        | 121.92     | 49
Boston    | mixed/composite | Ellison Building                        | 139        | 28
Boston    | steel           | Two International Place                 | 240.79     | 105
... (81 rows omitted)

In [49]:
sky.group(['city', 'material'], collect=max).select('city', 'material', 'height max')

city      | material        | height max
Atlanta   | concrete        | 264.25
Atlanta   | mixed/composite | 311.8
Atlanta   | steel           | 169.47
Austin    | concrete        | 208.15
Austin    | steel           | 93.6
Baltimore | concrete        | 161.24
Baltimore | steel           | 155.15
Boston    | concrete        | 121.92
Boston    | mixed/composite | 139
Boston    | steel           | 240.79
... (81 rows omitted)

In [50]:
sky2 = sky.select('city', 'material', 'height')
sky2.group(['city', 'material'], collect=max)

city      | material        | height max
Atlanta   | concrete        | 264.25
Atlanta   | mixed/composite | 311.8
Atlanta   | steel           | 169.47
Austin    | concrete        | 208.15
Austin    | steel           | 93.6
Baltimore | concrete        | 161.24
Baltimore | steel           | 155.15
Boston    | concrete        | 121.92
Boston    | mixed/composite | 139
Boston    | steel           | 240.79
... (81 rows omitted)

In [51]:
sky.pivot('city', 'material', values='height', collect=max)

material        | Atlanta | Austin | Baltimore | Boston | Charlotte | Chicago | Cincinnati | Cleveland | Columbus | Dallas | Denver | Detroit | Honolulu | Houston | Indianapolis | Jersey City | Kansas City | Las Vegas | Los Angeles | Miami  | Miami Beach | Milwaukee | Minneapolis | New York City | Philadelphia | Phoenix | Pittsburgh | Portland | Sacramento | Salt Lake City | San Diego | San Francisco | Seattle | St. Louis | Sunny Isles Beach
concrete        | 264.25  | 208.15 | 161.24    | 121.92 | 265.48    | 423.22  | 125        | 125       | 79.25    | 176.48 | 194.75 | 221.49  | 129.8    | 217.63  | 128.17       | 162.16      | 189.89      | 350.22    | 145.7       | 240.41 | 170.39      | 136       | 203.58      | 425.5         | 157.89       | 124.1   | 89.3       | 155.15   | 106.98     | 114.91         | 151.49    | 196.6         | 138.69  | 100.66    | 196
mixed/composite | 311.8   | 0      | 0         | 139    | 239.7     | 306.94  | 202.69     | 288.65    | 0        | 280.72 | 212.75 | 0       | 0        | 305.41  | 0            | 0           | 0           | 195.68    | 118.26      | 232.8  | 0           | 0         | 241.38      | 541.3         | 296.73       | 114     | 172        | 127.4    | 115.82     | 0              | 144.78    | 260           | 284.38  | 180.75    | 0
steel           | 169.47  | 93.6   | 155.15    | 240.79 | 179.23    | 442.14  | 175        | 215.8     | 169.3    | 270.06 | 217.63 | 173.26  | 130.75   | 302.37  | 213.67       | 238.05      | 146.61      | 160       | 310.29      | 147.52 | 0           | 183.19    | 144.64      | 381           | 288.04       | 147.22  | 256.34     | 166.42   | 122.6      | 128.63         | 152.4     | 237.44        | 235.31  | 147.6     | 0

In [52]:
#Age Difference
##Q) For each city, whats the age difference between the oldest steel building and 
##the oldest concrete building

In [53]:
#Start by asking
#How am I grouping things
#Find a format that makes it easy to find the differences in one operation

In [55]:
sky3 = sky.select('city', 'material', 'age')
sky3.group(['city', 'material'], collect=max)

city      | material        | age max
Atlanta   | concrete        | 44
Atlanta   | mixed/composite | 33
Atlanta   | steel           | 123
Austin    | concrete        | 36
Austin    | steel           | 83
Baltimore | concrete        | 53
Baltimore | steel           | 109
Boston    | concrete        | 49
Boston    | mixed/composite | 28
Boston    | steel           | 105
... (81 rows omitted)

In [57]:
#Find the difference between (Atlanta, concrete) & (Atlanta, steel)

In [ ]:
#Look at the pivot table

In [58]:
sky.pivot('city', 'material', values='age', collect=max)

material        | Atlanta | Austin | Baltimore | Boston | Charlotte | Chicago | Cincinnati | Cleveland | Columbus | Dallas | Denver | Detroit | Honolulu | Houston | Indianapolis | Jersey City | Kansas City | Las Vegas | Los Angeles | Miami | Miami Beach | Milwaukee | Minneapolis | New York City | Philadelphia | Phoenix | Pittsburgh | Portland | Sacramento | Salt Lake City | San Diego | San Francisco | Seattle | St. Louis | Sunny Isles Beach
concrete        | 44      | 36     | 53        | 49     | 28        | 91      | 66         | 40        | 57       | 42     | 60     | 44      | 50       | 50      | 57           | 22          | 107         | 47        | 31          | 92    | 24          | 32        | 54          | 93            | 95           | 91      | 56         | 36       | 28         | 54             | 35        | 87            | 39      | 53        | 22
mixed/composite | 33      | 0      | 0         | 28     | 18        | 94      | 9          | 62        | 0        | 35     | 42     | 0       | 0        | 44      | 0            | 0           | 0           | 13        | 44          | 38    | 0           | 0         | 47          | 48            | 30           | 29      | 10         | 36       | 29         | 0              | 12        | 48            | 48      | 32        | 0
steel           | 123     | 83     | 109       | 105    | 96        | 132     | 107        | 96        | 93       | 92     | 110    | 107     | 29       | 93      | 88           | 16          | 89          | 27        | 92          | 95    | 0           | 96        | 105         | 134           | 118          | 49      | 118        | 50       | 36         | 110            | 57        | 122           | 106     | 128       | 0

In [62]:
#Once you convert it to a column form, you can get an array and do array operations
#So just interchange
p = sky.pivot('material', 'city', values='age', collect=max)
p

city       | concrete | mixed/composite | steel
Atlanta    | 44       | 33              | 123
Austin     | 36       | 0               | 83
Baltimore  | 53       | 0               | 109
Boston     | 49       | 28              | 105
Charlotte  | 28       | 18              | 96
Chicago    | 91       | 94              | 132
Cincinnati | 66       | 9               | 107
Cleveland  | 40       | 62              | 96
Columbus   | 57       | 0               | 93
Dallas     | 42       | 35              | 92
... (25 rows omitted)

In [67]:
t = p.with_column('diff', p.column('steel') - p.column('concrete'))
t

city       | concrete | mixed/composite | steel | diff
Atlanta    | 44       | 33              | 123   | 79
Austin     | 36       | 0               | 83    | 47
Baltimore  | 53       | 0               | 109   | 56
Boston     | 49       | 28              | 105   | 56
Charlotte  | 28       | 18              | 96    | 68
Chicago    | 91       | 94              | 132   | 41
Cincinnati | 66       | 9               | 107   | 41
Cleveland  | 40       | 62              | 96    | 56
Columbus   | 57       | 0               | 93    | 36
Dallas     | 42       | 35              | 92    | 50
... (25 rows omitted)

Handedness   | Sleep position     | Hours of sleep
Right-handed | On your left side  | 6
Right-handed | On your left side  | 7.5
Right-handed | On your right side | 7.5
Right-handed | On your back       | 8
Right-handed | On your stomach    | 8
Right-handed | On your left side  | 8
Right-handed | On your stomach    | 7
Right-handed | On your back       | 7
Right-handed | On your back       | 7
Right-handed | On your right side | 8
... (1300 rows omitted)